### subset observations (rows)

In [67]:
import numpy as np
import pandas as pd

In [68]:
### subset observations (rows)# specify values for each column
import random
import string

emp_dict = {"id": ['EBDA'+str(x) for x in range(1001,1031)],
           "name": [random.choice(string.ascii_letters.lower())*3 for x in range(30)],
           "age": [random.randint(22,45) for _ in range(30)],
           "salary": [random.randint(25000,90000) for _ in range(30)]}

df = pd.DataFrame(data = emp_dict,
                  index= list(range(1,31))) # dict values length

In [69]:
# total dataset
df

          id name  age  salary
1   EBDA1001  eee   26   43416
2   EBDA1002  aaa   45   38522
3   EBDA1003  nnn   43   88737
4   EBDA1004  qqq   31   80034
5   EBDA1005  lll   25   45644
6   EBDA1006  ggg   40   32274
7   EBDA1007  ccc   26   40756
8   EBDA1008  kkk   39   80494
9   EBDA1009  ggg   38   37736
10  EBDA1010  fff   31   86488
11  EBDA1011  ccc   34   26561
12  EBDA1012  ddd   40   77006
13  EBDA1013  sss   27   66580
14  EBDA1014  aaa   40   50556
15  EBDA1015  www   23   49648
16  EBDA1016  ppp   26   31487
17  EBDA1017  mmm   39   46272
18  EBDA1018  lll   40   32209
19  EBDA1019  ppp   42   41006
20  EBDA1020  uuu   43   30536
21  EBDA1021  iii   38   77904
22  EBDA1022  jjj   29   43517
23  EBDA1023  qqq   24   44868
24  EBDA1024  eee   40   76643
25  EBDA1025  ttt   39   39932
26  EBDA1026  sss   31   31656
27  EBDA1027  ddd   24   36178
28  EBDA1028  uuu   45   63663
29  EBDA1029  kkk   45   79921
30  EBDA1030  hhh   25   65118

### df.head()

In [70]:
df.head() # first 5 rows

         id name  age  salary
1  EBDA1001  eee   26   43416
2  EBDA1002  aaa   45   38522
3  EBDA1003  nnn   43   88737
4  EBDA1004  qqq   31   80034
5  EBDA1005  lll   25   45644

In [71]:
# first n rows
df.head(12)

          id name  age  salary
1   EBDA1001  eee   26   43416
2   EBDA1002  aaa   45   38522
3   EBDA1003  nnn   43   88737
4   EBDA1004  qqq   31   80034
5   EBDA1005  lll   25   45644
6   EBDA1006  ggg   40   32274
7   EBDA1007  ccc   26   40756
8   EBDA1008  kkk   39   80494
9   EBDA1009  ggg   38   37736
10  EBDA1010  fff   31   86488
11  EBDA1011  ccc   34   26561
12  EBDA1012  ddd   40   77006

### df.tail()

In [72]:
# last 5 rows
df.tail()

          id name  age  salary
26  EBDA1026  sss   31   31656
27  EBDA1027  ddd   24   36178
28  EBDA1028  uuu   45   63663
29  EBDA1029  kkk   45   79921
30  EBDA1030  hhh   25   65118

In [73]:
# last n rows
df.tail(10)

          id name  age  salary
21  EBDA1021  iii   38   77904
22  EBDA1022  jjj   29   43517
23  EBDA1023  qqq   24   44868
24  EBDA1024  eee   40   76643
25  EBDA1025  ttt   39   39932
26  EBDA1026  sss   31   31656
27  EBDA1027  ddd   24   36178
28  EBDA1028  uuu   45   63663
29  EBDA1029  kkk   45   79921
30  EBDA1030  hhh   25   65118

### df.nlargest()

In [74]:
# df.nlargest(4,'id')
df.nlargest(10,'salary') # top 10 salaried employees starting from max salary### df.head()

          id name  age  salary
3   EBDA1003  nnn   43   88737
10  EBDA1010  fff   31   86488
8   EBDA1008  kkk   39   80494
4   EBDA1004  qqq   31   80034
29  EBDA1029  kkk   45   79921
21  EBDA1021  iii   38   77904
12  EBDA1012  ddd   40   77006
24  EBDA1024  eee   40   76643
13  EBDA1013  sss   27   66580
30  EBDA1030  hhh   25   65118

### df.nsmallest()

In [75]:
# df.nsmallest(4,'id')
df.nsmallest(10,'salary') # bottom 10 salaried employees starting from min salary### df.head()

          id name  age  salary
11  EBDA1011  ccc   34   26561
20  EBDA1020  uuu   43   30536
16  EBDA1016  ppp   26   31487
26  EBDA1026  sss   31   31656
18  EBDA1018  lll   40   32209
6   EBDA1006  ggg   40   32274
27  EBDA1027  ddd   24   36178
9   EBDA1009  ggg   38   37736
2   EBDA1002  aaa   45   38522
25  EBDA1025  ttt   39   39932

### df.sample()

In [76]:
df.sample(n = 10) # randomly select n rows### df.head()

          id name  age  salary
19  EBDA1019  ppp   42   41006
8   EBDA1008  kkk   39   80494
26  EBDA1026  sss   31   31656
2   EBDA1002  aaa   45   38522
30  EBDA1030  hhh   25   65118
16  EBDA1016  ppp   26   31487
21  EBDA1021  iii   38   77904
23  EBDA1023  qqq   24   44868
3   EBDA1003  nnn   43   88737
25  EBDA1025  ttt   39   39932

In [77]:
# randomly select fraction of rows
# df.sample(frac=0.5) # 50% of 30 rows = 15 rows (randomly)
df.sample(frac=0.25) # 25% of 30 rows = 7.5 => 8 rows (randomly)

          id name  age  salary
26  EBDA1026  sss   31   31656
15  EBDA1015  www   23   49648
16  EBDA1016  ppp   26   31487
6   EBDA1006  ggg   40   32274
8   EBDA1008  kkk   39   80494
14  EBDA1014  aaa   40   50556
12  EBDA1012  ddd   40   77006
25  EBDA1025  ttt   39   39932

### rows meeting specifc criteria df[df.col > num]

### >

In [78]:
# rows that meets a logical criteria
df[df.salary > 70000]
# df[df['salary'] > 70000]### df.head()### df.head()

          id name  age  salary
3   EBDA1003  nnn   43   88737
4   EBDA1004  qqq   31   80034
8   EBDA1008  kkk   39   80494
10  EBDA1010  fff   31   86488
12  EBDA1012  ddd   40   77006
21  EBDA1021  iii   38   77904
24  EBDA1024  eee   40   76643
29  EBDA1029  kkk   45   79921

### <

In [79]:
# <
df[df.salary < 35000]

          id name  age  salary
6   EBDA1006  ggg   40   32274
11  EBDA1011  ccc   34   26561
16  EBDA1016  ppp   26   31487
18  EBDA1018  lll   40   32209
20  EBDA1020  uuu   43   30536
26  EBDA1026  sss   31   31656

### <=

In [80]:
# <=
df[df.salary <= 33448]

          id name  age  salary
6   EBDA1006  ggg   40   32274
11  EBDA1011  ccc   34   26561
16  EBDA1016  ppp   26   31487
18  EBDA1018  lll   40   32209
20  EBDA1020  uuu   43   30536
26  EBDA1026  sss   31   31656

### >=

In [81]:
# >=
df[df.salary >= 85662]

          id name  age  salary
3   EBDA1003  nnn   43   88737
10  EBDA1010  fff   31   86488

### ==

In [82]:
# ==
### >=# df[df.id == 'ebda1026']
df[df.id == 'EBDA1026'] # case sensitive

          id name  age  salary
26  EBDA1026  sss   31   31656

### !=

In [83]:
# !=
df[(df.id != 'EBDA1026') & (df.salary > 85000)]

          id name  age  salary
3   EBDA1003  nnn   43   88737
10  EBDA1010  fff   31   86488

### df.col.isin()

In [84]:
# group membership
# df.columns.isin(['name','age'])
# df.name.isin(['aaa','bbb','ccc','ddd']) # True or False
df[df.name.isin(['aaa','bbb','ccc','ddd'])]

          id name  age  salary
2   EBDA1002  aaa   45   38522
7   EBDA1007  ccc   26   40756
11  EBDA1011  ccc   34   26561
12  EBDA1012  ddd   40   77006
14  EBDA1014  aaa   40   50556
27  EBDA1027  ddd   24   36178

### pd.isnull(df)

In [85]:
# is NaN
student = {'Name': ['John', 'Alice', 'Bob', 'Emma', 'Sam'],
        'Age': [25, 30, 22, np.nan, 35],
        'City': ['New York', np.nan, 'London', 'Paris', 'Tokyo']}
df_student = pd.DataFrame(student)
# pd.isnull(df_student)
pd.isnull(df_student.City)

0    False
1     True
2    False
3    False
4    False
Name: City, dtype: bool

### pd.notnull(df)

In [86]:
# is not NaN
pd.notnull(df_student)

   Name    Age   City
0  True   True   True
1  True   True  False
2  True   True   True
3  True  False   True
4  True   True   True

### df[(cond1) & (cond2)]

In [87]:
# & Logical and
df[(df['name'].isin(['aaa','bbb','ccc','ddd'])) & (df['age']<35)]

          id name  age  salary
7   EBDA1007  ccc   26   40756
11  EBDA1011  ccc   34   26561
27  EBDA1027  ddd   24   36178

### df[(cond1) | (cond2)]

In [88]:
# | logical or
df[(df['name']=='aaa') | (df['age']<30)]

          id name  age  salary
1   EBDA1001  eee   26   43416
2   EBDA1002  aaa   45   38522
5   EBDA1005  lll   25   45644
7   EBDA1007  ccc   26   40756
13  EBDA1013  sss   27   66580
14  EBDA1014  aaa   40   50556
15  EBDA1015  www   23   49648
16  EBDA1016  ppp   26   31487
22  EBDA1022  jjj   29   43517
23  EBDA1023  qqq   24   44868
27  EBDA1027  ddd   24   36178
30  EBDA1030  hhh   25   65118

### df[~(cond)]

In [89]:
# ~ logical not
df[~(df['age']>25)]

          id name  age  salary
5   EBDA1005  lll   25   45644
15  EBDA1015  www   23   49648
23  EBDA1023  qqq   24   44868
27  EBDA1027  ddd   24   36178
30  EBDA1030  hhh   25   65118

### ^

In [90]:
# ^ xor
df[(df['name']=='aaa') ^ (df['age']<30)]

          id name  age  salary
1   EBDA1001  eee   26   43416
2   EBDA1002  aaa   45   38522
5   EBDA1005  lll   25   45644
7   EBDA1007  ccc   26   40756
13  EBDA1013  sss   27   66580
14  EBDA1014  aaa   40   50556
15  EBDA1015  www   23   49648
16  EBDA1016  ppp   26   31487
22  EBDA1022  jjj   29   43517
23  EBDA1023  qqq   24   44868
27  EBDA1027  ddd   24   36178
30  EBDA1030  hhh   25   65118

In [91]:
df_student

    Name   Age      City
0   John  25.0  New York
1  Alice  30.0       NaN
2    Bob  22.0    London
3   Emma   NaN     Paris
4    Sam  35.0     Tokyo

### df.isna().any()

In [92]:
df_student.isna().any() # True only if any of the given 'col values' are np.nan

Name    False
Age      True
City     True
dtype: bool

### df.isnull().all()

In [93]:
df_student.isnull().all() # True only if all 'col values' are np.nan

Name    False
Age     False
City    False
dtype: bool

In [94]:
test = pd.DataFrame([[0,False,np.nan],[np.nan, np.nan, np.nan]])
test

     0      1   2
0  0.0  False NaN
1  NaN    NaN NaN

In [95]:
test.isnull().any()

0    True
1    True
2    True
dtype: bool

In [96]:
test.isnull().all()

0    False
1    False
2     True
dtype: bool

In [97]:
df.head()

         id name  age  salary
1  EBDA1001  eee   26   43416
2  EBDA1002  aaa   45   38522
3  EBDA1003  nnn   43   88737
4  EBDA1004  qqq   31   80034
5  EBDA1005  lll   25   45644

### df.set_index()

In [98]:
df.set_index('name', inplace=True)

In [99]:
df.head()

            id  age  salary
name
eee   EBDA1001   26   43416
aaa   EBDA1002   45   38522
nnn   EBDA1003   43   88737
qqq   EBDA1004   31   80034
lll   EBDA1005   25   45644

### df.filter(regex='')

In [100]:
df.filter(regex='^n', axis=0).head() # select rows by regex to index

            id  age  salary
name
nnn   EBDA1003   43   88737

### df.filter(like='')

In [101]:
df.filter(like='n',axis=0).head() # select rows by regex to index

            id  age  salary
name
nnn   EBDA1003   43   88737

### df.query('cond1 and cond2')

In [102]:
# query() allows boolean expr for filtering rows
df.query('age > 40')
# df[df.age > 40] # both are same

            id  age  salary
name
aaa   EBDA1002   45   38522
nnn   EBDA1003   43   88737
ppp   EBDA1019   42   41006
uuu   EBDA1020   43   30536
uuu   EBDA1028   45   63663
kkk   EBDA1029   45   79921

In [103]:
df.query('age > 40 and salary > 60000') 
# df[(df['age']>40) & (df['salary']>60000)] # both are same

            id  age  salary
name
nnn   EBDA1003   43   88737
uuu   EBDA1028   45   63663
kkk   EBDA1029   45   79921

### df.query('col.str.strfunc()')

In [104]:
df.query('id.str.endswith("5")')

            id  age  salary
name
lll   EBDA1005   25   45644
www   EBDA1015   23   49648
ttt   EBDA1025   39   39932

### df.drop_duplicates()

In [105]:
# remove duplicate rows
temp_df = pd.DataFrame([[1,2,3],
                         [1,2,3],
                         [4,5,6],
                         [1,2,7]])
temp_df

   0  1  2
0  1  2  3
1  1  2  3
2  4  5  6
3  1  2  7

In [106]:
temp_df.drop_duplicates() # removes duplicate rows in the result dataframe, choose inplace if needed

   0  1  2
0  1  2  3
2  4  5  6
3  1  2  7

In [107]:
temp_df

   0  1  2
0  1  2  3
1  1  2  3
2  4  5  6
3  1  2  7

### regex examples

```
'\.'              Matches strings containing a period '.'
'Length$'         Matches strings ending with word 'Length'
'^Sepal'          Matches strings beginning with the word 'Sepal'
'^x[1-5]$'        Matches strings beginning with 'x' and ending with 1 or 2 or 3 or 4 or 5
'^(?!Species$).*' Matches strings except the string 'Species'
? => 0 or 1 occurence
* => 0 or more occurences
. => any character except newline
^ => starts with
$ => ends with
```